.config/doom/config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

(setq gc-cons-threshold 100000000)

(setq read-process-output-max (* 1024 1024)) ;; 1mb

(setq user-full-name "Aniket Kharel"
      user-mail-address "aniketkhareldev@gmail.com")

(setq global_font "JetBrainsMono Nerd Font")
(setq global_font_size 15)
(setq global_font_weight 'Regular)
(setq global_variable_pitch_font "JetBrainsMono Nerd Font")
(setq global_variable_pitch_font_weight 15)

(custom-set-variables
 '(org-directory "~/org")
 '(org-agenda-files (list org-directory)))

(setq initial-buffer-choice "~/.config/doom/start.org")

(define-minor-mode start-mode
  "Provide functions for custom start page."
  :lighter " start"
  :keymap (let ((map (make-sparse-keymap)))
            ;;(define-key map (kbd "M-z") 'eshell)
            (evil-define-key 'normal start-mode-map
              (kbd "1") '(lambda () (interactive) (find-file "~/.config/doom/doom.org"))
              (kbd "2") '(lambda () (interactive) (find-file "~/.config/doom/init.el"))
              (kbd "3") '(lambda () (interactive) (find-file "~/.config/doom/packages.el")))
            map))

;; make start.org read-only; use 'SPC t r' to toggle off read-only.
(add-hook 'start-mode-hook 'read-only-mode)
(provide 'start-mode)

(setq doom-font (font-spec :family global_font :size global_font_size
                           :weight global_font_weight)
      doom-variable-pitch-font (font-spec :family global_variable_pitch_font
                                          :size global_variable_pitch_font_weight ))

(setq doom-theme 'doom-one)

(setq display-line-numbers-type 'relative)

(dolist (mode '(org-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(set-frame-parameter (selected-frame) 'alpha 100)
(add-to-list 'default-frame-alist '(alpha 100 100))

(setq visual-fill-column-width 110
      visual-fill-column-center-text t)

(add-hook 'prog-mode-hook #'display-fill-column-indicator-mode)

(use-package rainbow-mode
  :hook org-mode prog-mode)

(editorconfig-mode 1)
